<template>
    <el-container>
        <el-row :gutter="20">
            <el-col :span="6">
                <el-card class="box-card m-b-20">
                    <h1>Poker planning</h1>
                    <p>Покер планирования (англ. Planning Poker, а также англ. Scrum poker) — техника оценки,
                        основанная на достижении договорённости,
                        главным образом используемая для оценки сложности предстоящей работы или относительного объёма решаемых задач при разработке программного обеспечения.
                        Это разновидность метода Wideband Delphi.
                    </p>
                    <p>Она обычно используется в гибкой методологии разработки, в частности, в методологии экстремального программирования.</p>
                    <p>Метод впервые был описан Джеймсом Греннингом (James Grenning) в 2002 году и позднее популяризован Майком Коном (Mike Cohn) в книге «Agile Estimating and Planning»</p>
                </el-card>
                <el-card class="box-card">
                    <span class="stats">Онлайн: 2</span>
                    <span class="stats">Комнат создано: 2</span>
                    <span class="stats">Комнат занято: 0</span>
                </el-card>
            </el-col>
            <el-col :span="12">
                <el-card class="box-card">
                    <h1>Процедура проведения</h1>
                    <p>Каждому участнику обсуждения выдаётся по одной колоде карт. Все колоды идентичны друг другу.</p>
                    <p>Обсуждение проводится следующим образом:</p>
                    <ul>
                        <li>Ведущий (англ. Moderator), не участвующий в обсуждении, ведёт собрание.</li>
                        <li>Менеджер продукта (англ. Product Manager) представляет краткие обзоры каждого из пунктов.
                            Команда может задавать вопросы и вести обсуждение предложений и рисков.
                            Итог обсуждения записывается менеджером продукта.
                        </li>
                        <li>Участники выбирают по одной карте и кладут их рубашкой вверх,
                            показывая таким образом, что выбор сделан.
                            Числовые достоинства карт могут использоваться по-разному:
                            они могут означать количество дней, наиболее подходящие дни или относительные единицы сложности (англ. story points).
                            Во время обсуждения достоинствам не должны приписываться новые значения в зависимости от размера функций с целью избегания эффекта привязки.
                        </li>
                        <li>Каждый участник называет свою карту и переворачивает её.</li>
                        <li>Участникам с высокими и низкими оценками даётся возможность высказаться и обосновать свою оценку.</li>
                        <li>Процесс обсуждения продолжается до тех пор,
                            пока не будет достигнут консенсус.
                            Голос участника, который, скорее всего, будет владеть разработкой,
                            имеет больший вес в «голосовании на основе консенсуса».
                        </li>
                        <li>Таймер используется для обеспечения структурированности обсуждения;
                            ведущий или менеджер продукта может в любое время перезапустить таймер,
                            по истечении времени все обсуждения должны быть прекращены,
                            затем начинается новый круг покера.
                        </li>
                        <li>Выступления участников повторяются вновь и вновь.
                            Карты пронумерованы так, что чем больше число, тем больше неопределённость.
                            Так, если разработчик желает выбрать 6, но он не до конца уверен,
                            он выберет 5, либо может предусмотрительно выбрать 8.
                        </li>
                    </ul>
                </el-card>
            </el-col>
            <el-col :span="6">

            </el-col>
        </el-row>
    </el-container>

</template>

<style>
    .el-header {
        background-color: #B3C0D1;
        color: #333;
        line-height: 60px;
    }

    .el-aside {
        color: #333;
    }
    .stats {
        display: block;
        font-size: 20px;
    }
</style>

<script>
    export default {
        data() {
            const item = {
                date: '2016-05-02',
                name: 'Tom',
                address: 'No. 189, Grove St, Los Angeles'
            };
            return {
                tableData: Array(20).fill(item)
            }
        }
    };
</script>
